{
  "main": {
    "name":"Kris MacBan",
    "description":"I love to deal with people, change and new ideas. I believe that I am a confident and concise communicator. I offer a strong technical mind-set and have a genuine interest in using technology and creative thinking to solve business problems.",
    "image":"profilepic.jpg",
    "bio":"A qualified project, programme and change management professional (AgilePM, Prince2 Practitioner, APMP, MSP Practitioner), I am experienced in the full developmental life cycle and several benchmark methodologies. I also hold a Masters in Business Systems (NQF Level 9). This postgraduate degree program focused on Managerial Accounting & Management Information Systems and uniquely satisfies the growing interdependence between technology and finance within business decision making.",
    "contactmessage":"I welcome the chance to expand my professional network, if you’d like to get in touch please feel free to contact me via Linkedin.",
    "portfoliomessage":"My professional experience to date spans diverse commercial/strategic aspects of business. I have managed a diverse range of people and projects in the fields of higher education, finance and technology. I have a proven track record of delivering high profile change initiatives in business and IT change and have experience working with stakeholders (up to Executive level) to shape and control delivery.",
    "email": "im@krismac.com",
    "github":"https://github.com/krismac/",
    "articles":"https://medium.com/@imkrismac/",
    "address":{
      "city":"Edinburgh",
      "country":"Scotland"
    },
    "website": "http://www.krismac.com",
    "resumedownload":"http://krismac.com",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com/krismac",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com/imkrismac",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/krismac/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/imkrismac",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/krismac",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":" University College Cork",
        "degree":"Masters in Business Studies (Hons) - MIS & Managerial Accounting",
        "graduated":"2008 – 2010",
        "description":"An intensive course including Business Programming (.Net), Data Modelling (Oracle SQL, PL/SQL) Database Systems, Enterprise Business Processes, Business Communication & Reporting, Cost Management and Design of Management Accounting/ Finance Systems. The programme includes significant focus on applications such as Visual Studio, languages such as Visual Basic & Oracle (SQL). Within an applied research project - development of an Integrated ERP/Accounting system for a fresh breads company- I held the position of Project Manager. Throughout the course I was also the Class Rep."
      },
      {
        "school":"CodeClan",
        "degree":"SQA Professional Development Award",
        "graduated":"E25",
        "description":"Training in modern web and mobile software development methods and best practices (agile, source control, object-oriented programming, user experience design, test driven development) and languages (SQL, Ruby, Java, Javascript)."
      },
      {
        "school":"University College Cork",
        "degree":"Bachelor of Arts (Hons)",
        "graduated":"2003 – 2007",
        "description":"A liberal arts undergraduate focusing on public administration, modern Irish and world history. I held a particular interest Economics, the institutions of the European Union and Political Communication."
      }
    ],
    "work":[
      {
        "company":"Lloyds Banking Group",
        "title":"Full Stack Software Engineer",
        "years":"Oct 2018 – Present",
        "description":"Developing web solutions for the Insurance Division's agile Digital Lab, primarily using JavaScript, ReactJS & NodeJS. Currently part of a major programme of work improving journeys for our Workplace Pension customers."
      },
      {
        "title":"Programme Manager",
        "years":"Mar 2017 – Sep 2018",
        "description":"Responsibility for a team of business and IT project managers delivering multiple concurrent change projects for our Corporate Pensions & Retirement Account proposition. I am responsible for ensuring that customer focus is paramount within workstream delivery and that time, budget and quality standards are met. I serve across Insurance brands but primarily Scottish Widows and SWWP."
      },
      {
        "title":"Senior Project Manager",
        "years":"Mar 2016 – Mar 2017",
        "description":"Leading a team of business and IT project managers in the delivery of insurance change projects across multiple business units and products (Lloyds/Halifax/Bank of Scotland, Clerical Medical & Scottish Widow brands). Multiple concurrent projects ranked up to and including Gold (+3m). I assist with managing interdependencies within our portfolio and serve as a point of support/best practice and escalation for risks/issues. I lead on a range of continuous improvement activities within the division/BU and serve as a process auditor on behalf of the Group. I am also responsible for scoping, planning and managing change projects through the project delivery lifecycle. I ensure that time, budget and quality standards are met."
      },
      {
        "title":"Lead Project Manager",
        "years":"Nov 2013 – Mar 2016",
        "description":"Delivery of insurance change projects across multiple business units and products (Lloyds/Halifax/Bank of Scotland, Clerical Medical & Scottish Widow brands). Multiple concurrent projects ranked Silver/Bronze (up to £3m). I am also responsible for scoping, planning and managing my own change projects through the project delivery lifecycle. I ensure that time, budget and quality standards are met. I also lead on a range of continuous improvement activities within the division/BU and serve as an agile ambassador within the Division."
      },
      {
        "company":"Lionbridge",
        "title":"Global Project Manager",
        "years":"Oct 2011 – Nov 2013",
        "description":"Lionbridge is a leading provider of translation, development and testing solutions. We enable clients to create, release, manage and maintain their technology applications and web content globally. Based in Dun Laoghaire and then more recently working remotely from Edinburgh, I hold a Project Management role within our global Microsoft group. The focus of my work has been servicing a number of high profile Microsoft programs but particularly the Windows Operating System. Our team co-ordinate translators and software engineers in local and international offices (e.g. Mumbai, Beijing and Slovakia) in the localisation of core software and web services into over a hundred major and long tail languages."
      },
      {
        "company":"Irish Non Profit Knowledge Exchange (INKEx)",
        "title":"Project Manager",
        "years":"Sep 2010 – Oct 2011",
        "description":"Irish Nonprofits Knowledge Exchange (INKEx) was an independent, nonprofit technology project working to build a comprehensive, live database (MS SQL) to present Irish non-profit organisations to the web. As the Project Manager, I provide an important leadership role in the development of a new web based service (Irishnonprofits.ie) and a comprehensive data services infrastructure for and about public benefit entities in Ireland. Along with providing technical/business analysis, quality assurance (including test management and execution) and leadership within the full development life cycle - I am responsible for engaging with the community, funders and stakeholders."
      }
    ],
    "certs":[
      {
          "title":"SAFe 4",
          "board":"Scaled Agile, Inc.",
          "level":"Practitioner",
          "issued":"2019"

       },
       {
        "title":"Software Development",
        "board":"Scottish Qualifications Authority (SQA)",
        "level":"Professional Development Award - Level 8",
        "issued":"2019"
     },
     {
      "title":"AgilePM",
      "board":"DSDM Consortium",
      "level":"Foundation & Practitioner",
      "issued":"2016"
   },
   {
    "title":"Managing Successful Programmes (MSP) ",
    "board":"BCS, The Chartered Institute for IT",
    "level":"Foundation",
    "issued":"2016"
 },
 {
  "title":"Lean Six Sigma",
  "board":"Further Education and Training Awards Council (FETAC)",
  "level":"Green Belt",
  "issued":"2013"
},
 {
  "title":"APMP",
  "board":"Association for Project Management",
  "issued":"2013"
}
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"VueJs",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"Swift",
        "level":"50%"
      },
      {
        "name":"JAVA",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"INKEx",
        "category":"Irish nonprofit database and servoce",
        "image":"inkex.jpg",
        "url":"https://www.apollo.io/companies/Irish-Nonprofits-Knowledge-Exchange--INKEx-/55e156def3e5bb2c73000030"
      },
      {
        "title":"Windows 8",
        "category":"Localisation of Windows",
        "image":"windows.png",
        "url":"hhttps://www.microsoft.com/en-gb"
      }
    ]
  }
}
